#### Terraform Plan 🖌 🤖 ⚙️ 📖  `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.product_a.azurerm_key_vault_secret.key_vault[0] will be created
  + resource "azurerm_key_vault_secret" "key_vault" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "apfs-product4-fulano-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.product_a.random_password.postgresql_administrator_password[0] will be created
  + resource "random_password" "postgresql_administrator_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.product_a.module.create_key_vault[0].data.azuread_group.adgrp[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "adgrp" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "users-app1"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = (known after apply)
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.product_a.module.create_key_vault[0].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.product_a.module.create_key_vault[0].data.azurerm_resource_group.rgrp[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "rgrp" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "product4-fulano-dev"
      + tags       = (known after apply)
    }

  # module.product_a.module.create_key_vault[0].azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                   = [
          + {
              + certificate_permissions = (known after apply)
              + key_permissions         = (known after apply)
              + object_id               = (known after apply)
              + secret_permissions      = (known after apply)
              + storage_permissions     = (known after apply)
              + tenant_id               = (known after apply)
            },
          + {
              + certificate_permissions = (known after apply)
              + key_permissions         = (known after apply)
              + object_id               = (known after apply)
              + secret_permissions      = (known after apply)
              + storage_permissions     = (known after apply)
              + tenant_id               = (known after apply)
            },
        ]
      + enable_rbac_authorization       = false
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "akv-product4-fulano-dev"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = false
      + resource_group_name             = "product4-fulano-dev"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "ResourceName" = "akv-product4-fulano-dev"
          + "client"       = "fulano"
          + "product"      = "product4"
        }
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server.postgresql_flexible_server will be created
  + resource "azurerm_postgresql_flexible_server" "postgresql_flexible_server" {
      + administrator_login           = "postgres"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 7
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "apfs-product4-fulano-dev"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "product4-fulano-dev"
      + sku_name                      = "GP_Standard_D2ds_v4"
      + storage_mb                    = 32768
      + tags                          = {
          + "client"  = "fulano"
          + "product" = "product4"
        }
      + version                       = "14"
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server_configuration.postgresql_flexible_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "postgresql_flexible_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "plpgsql,pg_stat_statements,pg_buffercache,pgcrypto,citext"
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server_database.postgresql_flexible_db["backend"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "postgresql_flexible_db" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + name      = "backend"
      + server_id = (known after apply)
    }

  # module.product_a.module.create_postgresql[0].azurerm_postgresql_flexible_server_database.postgresql_flexible_db["hasura"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "postgresql_flexible_db" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + name      = "hasura"
      + server_id = (known after apply)
    }

  # module.product_a.module.create_resource_group.azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "product4-fulano-dev"
      + tags     = {
          + "client"  = "fulano"
          + "product" = "product4"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @nelsonrp24*